//CMPL03 JOB (COBOL),'COMPILA PROGRAMS MES 4',CLASS=A,MSGCLASS=X,REGION=0M
//*
//* PROYECTO MES 4: compila y linkea S0C7, S322 y VALIDA01.
//* (COBOL puro, sin CICS ni DB2: solo IGYCRCTL + IEWL)
//*
//COBOL  EXEC PGM=IGYCRCTL,REGION=0M
//STEPLIB DD DSN=IGY.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT5   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT6   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT7   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIB   DD DSN=USER.COPYLIB,DISP=SHR
//SYSLIN   DD DSN=USER.OBJLIB(S0C7),DISP=SHR
//SYSIN    DD DSN=USER.COB.SRC(S0C7),DISP=SHR
//COBOL2  EXEC PGM=IGYCRCTL,COND=(0,NE),REGION=0M
//STEPLIB DD DSN=IGY.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT5   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT6   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT7   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIB   DD DSN=USER.COPYLIB,DISP=SHR
//SYSLIN   DD DSN=USER.OBJLIB(S322),DISP=SHR
//SYSIN    DD DSN=USER.COB.SRC(S322),DISP=SHR
//COBOL3  EXEC PGM=IGYCRCTL,COND=(0,NE),REGION=0M
//STEPLIB DD DSN=IGY.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT5   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT6   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT7   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIB   DD DSN=USER.COPYLIB,DISP=SHR
//SYSLIN   DD DSN=USER.OBJLIB(VALIDA01),DISP=SHR
//SYSIN    DD DSN=USER.COB.SRC(VALIDA01),DISP=SHR
//LKED   EXEC PGM=IEWL,COND=(0,NE),REGION=0M
//SYSPRINT DD SYSOUT=*
//SYSLIB   DD DSN=USER.OBJLIB,DISP=SHR
//SYSLMOD  DD DSN=USER.LOADLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIN   DD *
 INCLUDE SYSLIB(S0C7)
 NAME S0C7(R)
 INCLUDE SYSLIB(S322)
 NAME S322(R)
 INCLUDE SYSLIB(VALIDA01)
 NAME VALIDA01(R)