//ASMMAP01 JOB (COBOL),'ASSEMBLER BMS CUST',CLASS=A,MSGCLASS=X,REGION=0M
//*
//* PROYECTO MES 3: ensambla el mapset BMS CUST.
//* Entrada : USER.BMS(CUST)           -> maps/CUST.map
//* SYSLIN  : USER.OBJLIB(CUST)        -> objeto (para linkear)
//* SYSPUNCH: USER.COPYLIB(CUST)       -> copybook simbolico COBOL
//* Ajusta los nombres USER.* a las librerias de tu entorno.
//*
//ASM    EXEC PGM=ASMA90,REGION=0M
//SYSPRINT DD SYSOUT=*
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=CEE.SCEEMAC,DISP=SHR
//         DD DSN=CICSTS.SDFH.MACLIB,DISP=SHR   *> macros DFHMSD/DFHMDF
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIN   DD DSN=USER.OBJLIB(CUST),DISP=SHR
//SYSPUNCH DD DSN=USER.COPYLIB(CUST),DISP=SHR
//SYSIN    DD DSN=USER.BMS(CUST),DISP=SHR