//CMPLCICS JOB (COBOL),'COMPILA CUST001 CICS+DB2',CLASS=A,MSGCLASS=X,REGION=0M
//*
//* PROYECTO MES 3: compilacion del programa CICS + DB2.
//* Cadena completa:
//*   1) Traductor CICS    (quita los EXEC CICS)
//*   2) Precompilador DB2 (quita los EXEC SQL, genera DBRM)
//*   3) Compilador COBOL  (IGYCRCTL)
//*   4) Linkage-editor    (DFHELII + stub DB2)
//* Ajusta las librerias y nombres USER.* a tu entorno.
//*
//* PASO 1: TRADUCTOR CICS
//TRANS   EXEC PGM=DFHECP1$,PARM='COBOL3'
//STEPLIB DD DSN=CICSTS.SDFHLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPUNCH DD DSN=&&TRANS,DISP=(NEW,PASS),SPACE=(CYL,(2,1))
//SYSIN    DD DSN=USER.CICSSRC(CUST001),DISP=SHR   *> cics/CUST001.cob
//*
//* PASO 2: PRECOMPILADOR DB2
//PRECOMP EXEC PGM=DSNHPC,COND=(0,NE),PARM='HOST(COBOL)'
//STEPLIB DD DSN=DB2V13.SDSNLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSIN    DD DSN=&&TRANS,DISP=(OLD,DELETE)
//SYSPUNCH DD DSN=&&PRECOMP,DISP=(NEW,PASS),SPACE=(CYL,(2,1))
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//*
//* PASO 3: COMPILADOR COBOL
//COBOL   EXEC PGM=IGYCRCTL,COND=(0,NE)
//STEPLIB DD DSN=IGY.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT5   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT6   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT7   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIB   DD DSN=USER.COPYLIB,DISP=SHR        *> copy CUST (mapa simbolico)
//         DD DSN=CICSTS.SDFHCOB,DISP=SHR      *> copybooks CICS COBOL
//SYSLIN   DD DSN=&&OBJ,DISP=(NEW,PASS),SPACE=(CYL,(2,1))
//SYSIN    DD DSN=&&PRECOMP,DISP=(OLD,DELETE)
//*
//* PASO 4: LINKAGE-EDITOR (CICS + stub DB2)
//LKED    EXEC PGM=IEWL,COND=(0,NE),REGION=0M
//SYSPRINT DD SYSOUT=*
//SYSLIB   DD DSN=CICSTS.SDFHLOAD,DISP=SHR     *> DFHELII
//         DD DSN=DB2V13.SDSNEXIT,DISP=SHR
//         DD DSN=DB2V13.SDSNLOAD,DISP=SHR     *> DSNHLI (stub DB2)
//SYSLMOD  DD DSN=USER.LOADLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIN   DD DSN=&&OBJ,DISP=(OLD,DELETE)
//         DD *
 INCLUDE SYSLIB(DFHELII)
 INCLUDE SYSLIB(DSNHLI)
 NAME CUST001(R)