//LINKMAP JOB (COBOL),'LINKEO MAPSET CUST',CLASS=A,MSGCLASS=X,REGION=0M
//*
//* PROYECTO MES 3: linkea el objeto del mapset BMS a la LOADLIB.
//* La definicion del grupo (GRPCUST) se instala despues con CEDA.
//*
//LKED   EXEC PGM=IEWL,REGION=0M
//SYSPRINT DD SYSOUT=*
//SYSLIB   DD DSN=USER.OBJLIB,DISP=SHR
//SYSLMOD  DD DSN=USER.LOADLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIN   DD *
 INCLUDE SYSLIB(CUST)
 NAME CUST(R)