//CTA0001C JOB (COBOL),'COMPILA CTA0001',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//* Compila y linka el programa CTA0001 con SQL embebido (DB2).
//* Requiere el entorno IBM Enterprise COBOL para z/OS + DB2.
//* El copybook CUENTA debe estar en la librería SYSLIB.
//*
//STEP1    EXEC PGM=IGYCRCTL,PARM=(SQL,'ADV')
//SYSIN    DD    DSN=MILLER.COBOL.SRC(CTA0001),DISP=SHR
//SYSLIB   DD    DSN=MILLER.COBOL.COPYLIB,DISP=SHR
//SYSLIN   DD    DSN=&&OBJ(C),DISP=(NEW,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT2   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT3   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT4   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT5   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT6   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT7   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSPRINT DD    SYSOUT=*
//SYSUDUMP DD    SYSOUT=*
//*
//STEP2    EXEC PGM=IEWL,PARM='XREF,LIST',COND=(8,LT,STEP1)
//SYSLIB   DD    DSN=SYS1.COB2LIB,DISP=SHR
//         DD    DSN=DB2.RUNLIB.LOAD,DISP=SHR
//SYSLIN   DD    DSN=&&OBJ(C),DISP=(OLD,DELETE)
//SYSLMOD  DD    DSN=MILLER.COBOL.LOAD(CTA0001),DISP=SHR
//SYSPRINT DD    SYSOUT=*
//SYSUT1   DD    UNIT=SYSDA,SPACE=(TRK,(1,1))